app/views/rentals/your_rentals.html.erb

SELECT "rentals".* FROM "rentals" WHERE "rentals"."room_id" = ?  [["room_id", 1]]
---
        <% @rooms.each do |room| %>
            <% room.rentals.each do |rental| %>