app/controllers/landowner_reviews_controller.rb

SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = ? AND "rentals"."room_id" = ? AND "rentals"."user_id" = ? ORDER BY "rentals"."id" ASC LIMIT ?  [["id", 5], ["room_id", 1], ["user_id", 2], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."type" IN ('LandownerReview') AND "reviews"."rental_id" = ? AND "reviews"."tenant_id" = ? ORDER BY "reviews"."id" ASC LIMIT ?  [["rental_id", 5], ["tenant_id", 2], ["LIMIT", 1]]
INSERT INTO "reviews" ("comment", "star", "room_id", "rental_id", "tenant_id", "landowner_id", "type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    #Check if the rental exist (room, tenant, landowner)

    @rental = Rental.where(
              id: landowner_review_params[:rental_id],
              room_id: landowner_review_params[:room_id],
              user_id: landowner_review_params[:tenant_id]
              ).first

    if !@rental.nil?
      @has_reviewed = LandownerReview.where(
                        rental_id: @rental.id,
                        tenant_id: landowner_review_params[:tenant_id]
                      ).first

      if @has_reviewed.nil?
        #Enable review
          @landowner_review = current_user.landowner_reviews.create(landowner_review_params)