app/controllers/rentals_controller.rb

  def create
    room = Room.find(params[:room_id])

    if current_user == room.user
      flash[:alert] = "Don't be silly, that's your own 🏠"
    else
      start_date = Date.parse(rental_params[:start_date])
      end_date = start_date + (rental_params[:rent_period].to_i).months

      @rental = current_user.rentals.build(rental_params)
      @rental.room = room
      @rental.price = room.price
      @rental.end_date = end_date
      @rental.total = room.price * (rental_params[:rent_period].to_i)
      @rental.save
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
INSERT INTO "rentals" ("user_id", "room_id", "start_date", "end_date", "rent_period", "price", "total", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def your_landowners
    @landowners= current_user.rentals.order(start_date: :asc)
---
SELECT "rentals".* FROM "rentals" WHERE "rentals"."user_id" = ? ORDER BY "rentals"."start_date" ASC  [["user_id", 2]]