app/controllers/reservations_controller.rb

  def create
    room = Room.find(params[:room_id])

    if current_user == room.user
      flash[:alert] = "Don't be silly, that's your own 🏠"
    else
      start_date = Date.parse(reservation_params[:start_date])
      end_date = Date.parse(reservation_params[:end_date])
      days = (end_date - start_date).to_i + 1

      @reservation = current_user.reservations.build(reservation_params)
      @reservation.room = room
      @reservation.price = room.price
      @reservation.total = room.price * days
      @reservation.save
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
INSERT INTO "reservations" ("user_id", "room_id", "start_date", "end_date", "price", "total", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)