app/controllers/rooms_controller.rb

  def create
    @room = current_user.rooms.build(room_params)
    if @room.save
---
INSERT INTO "rooms" ("home_type", "room_type", "accommodate", "bed_room", "bath_room", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def preload
      today = Date.today
      rentals = @room.rentals.where("start_date >= ? OR end_date >= ?", today, today)
---
SELECT "rentals".* FROM "rentals" WHERE "rentals"."room_id" = ? AND (start_date >= '2017-09-25' OR end_date >= '2017-09-25')  [["room_id", 1]]

  def update
    new_params = room_params
    new_params = room_params.merge(active: true) if is_ready_room

      if @room.update(new_params)
---
UPDATE "rooms" SET "is_ac" = ?, "is_wifi" = ?, "is_furnished" = ?, "is_cooking" = ?, "is_washing" = ?, "updated_at" = ? WHERE "rooms"."id" = ?  [["is_ac", "t"], ["is_wifi", "t"], ["is_furnished", "t"], ["is_cooking", "t"], ["is_washing", "t"], ["updated_at", "2017-09-22 11:38:23.091695"], ["id", 8]]

    def set_room
      @room = Room.find(params[:id])
---
SELECT rooms.*, (69.09332411348201 * ABS(rooms.latitude - 40.7110671) * 0.7071067811865475) + (59.836573914187355 * ABS(rooms.longitude - -73.6034584) * 0.7071067811865475) AS distance, CASE WHEN (rooms.latitude >= 40.7110671 AND rooms.longitude >= -73.6034584) THEN  45.0 WHEN (rooms.latitude <  40.7110671 AND rooms.longitude >= -73.6034584) THEN 135.0 WHEN (rooms.latitude <  40.7110671 AND rooms.longitude <  -73.6034584) THEN 225.0 WHEN (rooms.latitude >= 40.7110671 AND rooms.longitude <  -73.6034584) THEN 315.0 END AS bearing FROM "rooms" WHERE (rooms.latitude BETWEEN 40.56633531688915 AND 40.85579888311085 AND rooms.longitude BETWEEN -73.79439532087777 AND -73.41252147912222 AND rooms.id != 12) ORDER BY distance ASC