app/controllers/tenant_reviews_controller.rb

SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = ? AND "rentals"."room_id" = ? ORDER BY "rentals"."id" ASC LIMIT ?  [["id", 7], ["room_id", 3], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."type" IN ('TenantReview') AND "reviews"."rental_id" = ? AND "reviews"."landowner_id" = ? ORDER BY "reviews"."id" ASC LIMIT ?  [["rental_id", 7], ["landowner_id", 2], ["LIMIT", 1]]
INSERT INTO "reviews" ("comment", "star", "room_id", "rental_id", "tenant_id", "landowner_id", "type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    #Check if the rental exist (room, tenant, landowner)

    @rental = Rental.where(
              id: tenant_review_params[:rental_id],
              room_id: tenant_review_params[:room_id],
              ).first

    if !@rental.nil? && @rental.room.user.id == tenant_review_params[:landowner_id].to_i
      @has_reviewed = TenantReview.where(
                        rental_id: @rental.id,
                        landowner_id: tenant_review_params[:landowner_id]
                      ).first

      if @has_reviewed.nil?
        #Enable review
          @tenant_review = current_user.tenant_reviews.create(tenant_review_params)