app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @rooms = @user.rooms

    # Display all the Tenants' reviews to Landowner
    @tenant_reviews = Review.where(type: "TenantReview", landowner_id: @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."type" = ? AND "reviews"."landowner_id" = ? ORDER BY "reviews"."id" DESC  [["type", "TenantReview"], ["landowner_id", 2]]